# Pandas

In [1]:
#It is the excel in python
import pandas as pd

In [2]:
pd.Series([4,2,4,5,7,4,3,2])

0    4
1    2
2    4
3    5
4    7
5    4
6    3
7    2
dtype: int64

In [3]:
pd.Series([[3,4,5,6],[8,3,4,5]])

0    [3, 4, 5, 6]
1    [8, 3, 4, 5]
dtype: object

In [4]:
score = {"Name" : ["Pamela","Tadiwa","Takudzwa","Patience"],"Testscore" : [45,21,21,32],"Examscore" : [65,32,45,64]}

In [5]:
score

{'Name': ['Pamela', 'Tadiwa', 'Takudzwa', 'Patience'],
 'Testscore': [45, 21, 21, 32],
 'Examscore': [65, 32, 45, 64]}

In [8]:
pd.DataFrame(score)#default index numbers

       Name  Testscore  Examscore
0    Pamela         45         65
1    Tadiwa         21         32
2  Takudzwa         21         45
3  Patience         32         64

In [10]:
data = pd.DataFrame(score,index = ["Maths","English","Chemistry","Physics"])#choosing my own index names
data

               Name  Testscore  Examscore
Maths        Pamela         45         65
English      Tadiwa         21         32
Chemistry  Takudzwa         21         45
Physics    Patience         32         64

In [11]:
data.Name

Maths          Pamela
English        Tadiwa
Chemistry    Takudzwa
Physics      Patience
Name: Name, dtype: object

In [12]:
data['Name']

Maths          Pamela
English        Tadiwa
Chemistry    Takudzwa
Physics      Patience
Name: Name, dtype: object

In [13]:
data['Testscore']

Maths        45
English      21
Chemistry    21
Physics      32
Name: Testscore, dtype: int64

In [14]:
data['Total_Score'] = data['Testscore'] + data['Examscore']

In [15]:
data

               Name  Testscore  Examscore  Total_Score
Maths        Pamela         45         65          110
English      Tadiwa         21         32           53
Chemistry  Takudzwa         21         45           66
Physics    Patience         32         64           96

# DataFrame Filtering

In [19]:
data.iloc[0,:]

Name           Pamela
Testscore          45
Examscore          65
Total_Score       110
Name: Maths, dtype: object

In [21]:
data.loc[:,['Name','Testscore','Examscore','Total_Score']]

               Name  Testscore  Examscore  Total_Score
Maths        Pamela         45         65          110
English      Tadiwa         21         32           53
Chemistry  Takudzwa         21         45           66
Physics    Patience         32         64           96

In [22]:
data.iloc[:2,:]

           Name  Testscore  Examscore  Total_Score
Maths    Pamela         45         65          110
English  Tadiwa         21         32           53

In [23]:
data.iloc[2:,:]

               Name  Testscore  Examscore  Total_Score
Chemistry  Takudzwa         21         45           66
Physics    Patience         32         64           96

In [25]:
data.iloc[[1,2],:]

               Name  Testscore  Examscore  Total_Score
English      Tadiwa         21         32           53
Chemistry  Takudzwa         21         45           66

In [26]:
data.iloc[1,2]

32

In [29]:
data['Examscore'] > 32

Maths         True
English      False
Chemistry     True
Physics       True
Name: Examscore, dtype: bool

In [30]:
data[data['Examscore'] > 32]

               Name  Testscore  Examscore  Total_Score
Maths        Pamela         45         65          110
Chemistry  Takudzwa         21         45           66
Physics    Patience         32         64           96

In [31]:
data[(data['Examscore'] > 32) & (data['Testscore'] > 30)]

             Name  Testscore  Examscore  Total_Score
Maths      Pamela         45         65          110
Physics  Patience         32         64           96

In [32]:
score = {"Name" : ["Jacinth","Kennedy","Adrian","Ashley","Timukudze","Tatenda"], "Test Score" : [21,23,45,32,None,12],
         "Exam Score" : [65,32,45,67,23,None]}

In [33]:
score

{'Name': ['Jacinth', 'Kennedy', 'Adrian', 'Ashley', 'Timukudze', 'Tatenda'],
 'Test Score': [21, 23, 45, 32, None, 12],
 'Exam Score': [65, 32, 45, 67, 23, None]}

In [35]:
d = pd.DataFrame(score)#NaN means not a number and they represent missing numbers
d

        Name  Test Score  Exam Score
0    Jacinth        21.0        65.0
1    Kennedy        23.0        32.0
2     Adrian        45.0        45.0
3     Ashley        32.0        67.0
4  Timukudze         NaN        23.0
5    Tatenda        12.0         NaN

In [36]:
d.describe()

       Test Score  Exam Score
count       5.000    5.000000
mean       26.600   46.400000
std        12.502   19.539703
min        12.000   23.000000
25%        21.000   32.000000
50%        23.000   45.000000
75%        32.000   65.000000
max        45.000   67.000000

In [37]:
d.describe().T

            count  mean        std   min   25%   50%   75%   max
Test Score    5.0  26.6  12.502000  12.0  21.0  23.0  32.0  45.0
Exam Score    5.0  46.4  19.539703  23.0  32.0  45.0  65.0  67.0

In [38]:
d.head()#automatically shows the first 5 items unless arguments are passed in the brackets

        Name  Test Score  Exam Score
0    Jacinth        21.0        65.0
1    Kennedy        23.0        32.0
2     Adrian        45.0        45.0
3     Ashley        32.0        67.0
4  Timukudze         NaN        23.0

In [39]:
d.head(2)

      Name  Test Score  Exam Score
0  Jacinth        21.0        65.0
1  Kennedy        23.0        32.0

In [40]:
d.tail()#automatically shows the bottom 5 elements unless an argument is passed within the brackets

        Name  Test Score  Exam Score
1    Kennedy        23.0        32.0
2     Adrian        45.0        45.0
3     Ashley        32.0        67.0
4  Timukudze         NaN        23.0
5    Tatenda        12.0         NaN

In [41]:
d.tail(2)

        Name  Test Score  Exam Score
4  Timukudze         NaN        23.0
5    Tatenda        12.0         NaN

In [42]:
d.sample(n=2)

      Name  Test Score  Exam Score
0  Jacinth        21.0        65.0
3   Ashley        32.0        67.0

In [43]:
d.isna()

    Name  Test Score  Exam Score
0  False       False       False
1  False       False       False
2  False       False       False
3  False       False       False
4  False        True       False
5  False       False        True

In [44]:
d.isna().sum()

Name          0
Test Score    1
Exam Score    1
dtype: int64

In [45]:
d.isnull().sum()

Name          0
Test Score    1
Exam Score    1
dtype: int64

In [47]:
d.describe().T

            count  mean        std   min   25%   50%   75%   max
Test Score    5.0  26.6  12.502000  12.0  21.0  23.0  32.0  45.0
Exam Score    5.0  46.4  19.539703  23.0  32.0  45.0  65.0  67.0

In [48]:
d.fillna(12)

        Name  Test Score  Exam Score
0    Jacinth        21.0        65.0
1    Kennedy        23.0        32.0
2     Adrian        45.0        45.0
3     Ashley        32.0        67.0
4  Timukudze        12.0        23.0
5    Tatenda        12.0        12.0

In [49]:
d.fillna(d['Test Score'].mean(),inplace = True)

In [50]:
d

        Name  Test Score  Exam Score
0    Jacinth        21.0        65.0
1    Kennedy        23.0        32.0
2     Adrian        45.0        45.0
3     Ashley        32.0        67.0
4  Timukudze        26.6        23.0
5    Tatenda        12.0        26.6

In [ ]:
#data = pd.read_csv(r'document information' )
#data.head()
# the above codes allow you to access and diplay of a document

In [ ]:
#'data.columns' displays the names of all the columns
#x=[names the columns you want to delete] then write data.drop(x) as code and you delete everything in x
#data.shape gives you the number of rows and columns